bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32H7A3x.svd
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>GPIO port bit set/reset
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BS0</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS8</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS9</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS10</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS11</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS12</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS13</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS14</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BS15</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR0</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <displayName>LCKR</displayName>
          <description>This register is used to lock the
          configuration of the port bits when a correct write
          sequence is applied to bit 16 (LCKK). The value of bits
          [15:0] is used to lock the configuration of the GPIO.
          During the write sequence, the value of LCKR[15:0] must
          not change. When the LOCK sequence has been applied on a
          port bit, the value of this port bit can no longer be
          modified until the next MCU reset or peripheral reset.A
          specific write sequence is used to write to the
          GPIOx_LCKR register. Only word access (32-bit long) is
          allowed during this locking sequence.Each lock bit
          freezes a specific configuration register (control and
          alternate function registers).</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LCK0</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK1</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK2</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK3</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK4</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK5</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK6</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK7</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK8</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK9</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK10</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK11</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK12</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK13</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK14</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCK15</name>
              <description>Port x lock bit y (y= 0..15) These bits
              are read/write but can only be written when the LCKK
              bit is 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCKK</name>
              <description>Lock key This bit can be read any time.
              It can only be modified using the lock key write
              sequence. LOCK key write sequence: WR LCKR[16] = 1 +
              LCKR[15:0] WR LCKR[16] = 0 + LCKR[15:0] WR LCKR[16] =
              1 + LCKR[15:0] RD LCKR RD LCKR[16] = 1 (this read
              operation is optional but it confirms that the lock
              is active) Note: During the LOCK key write sequence,
              the value of LCK[15:0] must not change. Any error in
              the lock sequence aborts the lock. After the first
              lock sequence on any bit of the port, any read access
              on the LCKK bit will return 1 until the next MCU
              reset or peripheral reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <displayName>AFRL</displayName>
          <description>GPIO alternate function low
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>[3:0]: Alternate function selection for
              port x pin y (y = 0..7) These bits are written by
              software to configure alternate function I/Os AFSELy
              selection:</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
