bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32H7A3x.svd
        <register>
          <name>RTC_BKP7R</name>
          <displayName>RTC_BKP7R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP8R</name>
          <displayName>RTC_BKP8R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP9R</name>
          <displayName>RTC_BKP9R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP10R</name>
          <displayName>RTC_BKP10R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP11R</name>
          <displayName>RTC_BKP11R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP12R</name>
          <displayName>RTC_BKP12R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP13R</name>
          <displayName>RTC_BKP13R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP14R</name>
          <displayName>RTC_BKP14R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP15R</name>
          <displayName>RTC_BKP15R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_OR</name>
          <displayName>RTC_OR</displayName>
          <description>RTC option register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC_ALARM_TYPE</name>
              <description>RTC_ALARM output type on
              PC13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC_OUT_RMP</name>
              <description>RTC_OUT remap</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP16R</name>
          <displayName>RTC_BKP16R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP17R</name>
          <displayName>RTC_BKP17R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP18R</name>
          <displayName>RTC_BKP18R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP19R</name>
          <displayName>RTC_BKP19R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP20R</name>
          <displayName>RTC_BKP20R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP21R</name>
          <displayName>RTC_BKP21R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP22R</name>
          <displayName>RTC_BKP22R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP23R</name>
          <displayName>RTC_BKP23R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP24R</name>
          <displayName>RTC_BKP24R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP25R</name>
          <displayName>RTC_BKP25R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP26R</name>
          <displayName>RTC_BKP26R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP27R</name>
          <displayName>RTC_BKP27R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_BKP28R</name>
          <displayName>RTC_BKP28R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
